In [15]:
import pandas as pd

data = {
    'Department': ['IT','HR','IT','HR','Finance','IT','Finance'],
    'Employee':  ['Pavan','Ravi','Anu','Sneha','Arjun','Riya','Divya'],
    'Salary':    [50000,45000,52000,48000,55000,53000,60000],
    'Experience':[2,3,4,5,3,2,6]
}

data = pd.DataFrame(data)

In [16]:
data.head(10)

  Department Employee  Salary  Experience
0         IT    Pavan   50000           2
1         HR     Ravi   45000           3
2         IT      Anu   52000           4
3         HR    Sneha   48000           5
4    Finance    Arjun   55000           3
5         IT     Riya   53000           2
6    Finance    Divya   60000           6

In [17]:
data["Department"].unique()

array(['IT', 'HR', 'Finance'], dtype=object)

In [18]:
data.groupby("Department")["Salary"].mean()

Department
Finance    57500.000000
HR         46500.000000
IT         51666.666667
Name: Salary, dtype: float64

In [19]:
data.groupby("Department")["Experience"].max()

Department
Finance    6
HR         5
IT         4
Name: Experience, dtype: int64

In [20]:
data.groupby("Department")["Experience"].min()

Department
Finance    3
HR         3
IT         2
Name: Experience, dtype: int64

In [21]:
data.groupby("Department")[["Salary","Experience"]].mean().max()

Salary        57500.0
Experience        4.5
dtype: float64

In [29]:
data.groupby("Department")[["Salary","Experience"]].agg(['mean','max','min','std'])

                  Salary                            Experience          \
                    mean    max    min          std       mean max min
Department
Finance     57500.000000  60000  55000  3535.533906   4.500000   6   3
HR          46500.000000  48000  45000  2121.320344   4.000000   5   3
IT          51666.666667  53000  50000  1527.525232   2.666667   4   2


                 std
Department
Finance     2.121320
HR          1.414214
IT          1.154701

In [30]:
data.groupby("Department").agg(
    av_salary = ('Salary','mean')
)

               av_salary
Department
Finance     57500.000000
HR          46500.000000
IT          51666.666667